app/controllers/incidents_controller.rb

  def index
    @incidents = Incident.all
---
SELECT  "incidents".* FROM "incidents"   ORDER BY "incidents"."id" DESC LIMIT 1

  def news
    @incidents = Incident.where("updated_at < ?", Time.now.yesterday)
---
SELECT "incidents".* FROM "incidents"  WHERE (updated_at > '2014-07-10 12:14:29.310665')

  def show
    @incident = Incident.find(params[:id])
---
SELECT  "incidents".* FROM "incidents"  WHERE "incidents"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @incident=Incident.find(params[:id])
---
SELECT  "incidents".* FROM "incidents"  WHERE "incidents"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @incident = Incident.new(incident_params)

    respond_to do |format|
      if @incident.save
---
INSERT INTO "incidents" ("created_at", "description", "latitude", "longitude", "mountain", "title", "updated_at", "when") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @incident.update(incident_params)
---
UPDATE "incidents" SET "description" = ?, "latitude" = ?, "mountain" = ?, "title" = ?, "updated_at" = ? WHERE "incidents"."id" = 7  [["description", ""], ["latitude", 20.24158281954221], ["mountain", "Red Sea"], ["title", "Red"], ["updated_at", "2014-07-16 14:23:45.088096"]]

  def destroy
    @incident.destroy
---
DELETE FROM "incidents" WHERE "incidents"."id" = ?  [["id", 4]]

    def set_incident
      @incident = Incident.find(params[:id])
---
SELECT  "incidents".* FROM "incidents"  WHERE "incidents"."id" = ? LIMIT 1  [["id", 4]]